# Part 2: Full Data Workflow A-Z

## Cleaning Data

### First Inspection / Handling inconsistent Data

In [ ]:
import pandas as pd

#### Titanic Dataset

In [10]:
titanic = pd.read_csv("titanic_imp.csv")

In [ ]:
titanic.head()

In [ ]:
titanic.tail()

In [ ]:
titanic.info()

In [ ]:
titanic.describe()

In [ ]:
titanic.describe(include ="O")

In [ ]:
titanic.Survived.unique()

In [ ]:
titanic.Survived.value_counts()

In [ ]:
titanic.Survived.replace(to_replace= ["yes", "no"], value = [1, 0], inplace = True)

In [ ]:
titanic.Survived.value_counts()

#### Olympic Dataset

In [11]:
summer = pd.read_csv("summer_imp.csv")

In [ ]:
summer.head()

In [ ]:
summer.tail()

In [ ]:
summer.info()

In [ ]:
#summer.Athlete_Name

In [ ]:
summer.rename(columns = {"Athlete Name": "Athlete_Name"}, inplace = True)

In [ ]:
summer.head(20)

In [ ]:
summer.Medal.value_counts()

In [ ]:
summer.Medal.replace(to_replace= "Gold Medal", value = "Gold", inplace = True)

In [ ]:
summer.describe(include = "O")

### String Operations

#### Titanic Dataset

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
#pd.to_numeric(titanic.Fare)

In [ ]:
titanic.Fare = titanic.Fare.str.replace("$", "")

In [ ]:
titanic.Fare.head()

#### Olympic Dataset

In [ ]:
summer.head(20)

In [ ]:
summer.info()

In [ ]:
summer.Athlete_Name = summer.Athlete_Name.str.title()

In [ ]:
summer.head(10)

In [ ]:
summer.loc[summer.Athlete_Name.str.contains("Hajos")]

In [ ]:
summer.iloc[0, 4]

In [ ]:
summer.Athlete_Name = summer.Athlete_Name.str.strip()

In [ ]:
summer.loc[summer.Athlete_Name == "Hajos, Alfred"]

In [ ]:
summer.loc[summer.Athlete_Name == "Phelps, Michael"]

### Changing DataType with astype() / pd.to_numeric

#### Titanic Dataset

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
pd.to_numeric(titanic.Fare)

In [ ]:
titanic.Fare.astype("float")

In [ ]:
titanic["Fare"] = titanic.Fare.astype("float")

In [ ]:
titanic["Survived"] = titanic.Survived.astype("int")

In [ ]:
#titanic["Age"] = titanic.Age.astype("float")

In [ ]:
titanic.info()

In [ ]:
titanic.head()

#### Olympic Dataset

In [ ]:
summer.head()

In [ ]:
summer.info()

### Intro to NA Values

In [ ]:
import numpy as np

In [ ]:
sales = pd.read_csv("sales.csv", index_col = 0)

In [ ]:
sales

In [ ]:
sales.info()

In [ ]:
sales.loc["Steven", "Thu"]

In [ ]:
sales.iloc[1,1] = None

In [ ]:
sales

In [ ]:
sales.iloc[2,2] = np.nan

In [ ]:
sales

In [ ]:
sales.info()

#### Titanic Dataset

In [ ]:
titanic.head(10)

In [ ]:
titanic.tail(10)

In [ ]:
titanic.info()

In [ ]:
titanic.isna()

In [ ]:
titanic.isna().sum(axis = 0)

In [ ]:
titanic.isna().any(axis = 1)

In [ ]:
titanic[titanic.isna().any(axis = 1)]

In [ ]:
titanic.notna()

In [ ]:
titanic.notna().sum(axis = 1)

In [ ]:
titanic.notna().all(axis = 0)

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
plt.figure(figsize = (12,8))
sns.heatmap(titanic.notna())
plt.show()

In [ ]:
titanic.Age.value_counts(dropna = False)

In [ ]:
titanic.Age.replace(to_replace= "Missing Data", value = np.nan, inplace= True)

In [ ]:
titanic.info()

In [ ]:
titanic.Age = titanic.Age.astype("float")

#### Olympic Dataset

In [ ]:
summer.head()

In [ ]:
summer.info()

In [ ]:
summer[summer.isna().any(axis = 1)]

### Removing Missing Values with dropna()

#### Titanic Dataset

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
titanic[titanic.Emb.isna()]

In [ ]:
titanic.Age.value_counts(dropna = False)

In [ ]:
titanic.Age.mean(skipna = True)

In [ ]:
titanic.shape

In [ ]:
titanic.dropna().shape

In [ ]:
titanic.dropna(axis = 0, how = "any").shape

In [ ]:
titanic.dropna(axis = 1, how = "any").shape

In [ ]:
titanic.dropna(axis = 0, how = "all").shape

In [ ]:
titanic.dropna(axis = 1, how = "all").shape

In [ ]:
titanic.dropna(axis = 0, thresh = 8).shape

In [ ]:
titanic.dropna(axis = 1, thresh = 500).shape

In [ ]:
titanic.dropna(axis = 1, thresh = 500, inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic.shape

In [ ]:
titanic.dropna(axis = 0, subset = ["Survived", "Class", "Gender", "Age"], how = "any").shape

#### Olympic Dataset

In [ ]:
summer.head()

In [ ]:
summer.info()

In [ ]:
summer[summer.isna().any(axis = 1)]

In [ ]:
summer.dropna(inplace = True)

In [ ]:
summer.info()

### Replacing Missing Values with fillna()

#### Titanic Dataset

In [ ]:
titanic.head(10)

In [ ]:
titanic.info()

In [ ]:
titanic.Age.mean()

In [ ]:
mean = round(titanic.Age.mean(),1)
mean

In [ ]:
titanic.Age.fillna(mean, inplace = True)

In [ ]:
titanic.head(6)

In [ ]:
titanic.info()

### Detection of Duplicates

In [1]:
import pandas as pd

C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.NOIJJG62EMASZI6NYURL6JBKM4EVBGM7.gfortran-win_amd64.dll
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
  stacklevel=1)

In [2]:
alphabet = pd.DataFrame(["a", "b", "c", "c", "d", "e", "f", "g", "g", "g"], columns = ["Alphabet"])

In [3]:
alphabet

  Alphabet
0        a
1        b
2        c
3        c
4        d
5        e
6        f
7        g
8        g
9        g

In [4]:
alphabet.duplicated(keep = False)

0    False
1    False
2     True
3     True
4    False
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [8]:
alphabet[alphabet.duplicated(keep = 'first')]

  Alphabet
3        c
8        g
9        g

#### Titanic Dataset

In [12]:
titanic.head()

  Survived  Class  Gender   Age  SibSip  ParCh      Fare Emb Deck
0        0      3    male  22.0       1      0     $7.25   S  NaN
1        1      1  female  38.0       1      0  $71.2833   C    C
2        1      3  female  26.0       0      0    $7.925   S  NaN
3        1      1  female  35.0       1      0     $53.1   S    C
4        0      3    male  35.0       0      0     $8.05   S  NaN

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  894 non-null    object
 1   Class     894 non-null    int64
 2   Gender    894 non-null    object
 3   Age       758 non-null    object
 4   SibSip    894 non-null    int64
 5   ParCh     894 non-null    int64
 6   Fare      894 non-null    object
 7   Emb       892 non-null    object
 8   Deck      203 non-null    object
dtypes: int64(3), object(6)
memory usage: 63.0+ KB

In [16]:
titanic.duplicated(keep = "first").sum()

97

In [18]:
titanic[titanic.duplicated(keep = False)]

    Survived  Class  Gender           Age  SibSip  ParCh     Fare Emb Deck
4          0      3    male          35.0       0      0    $8.05   S  NaN
29         0      3    male  Missing Data       0      0  $7.8958   S  NaN
32         1      3  female  Missing Data       0      0    $7.75   Q  NaN
37         0      3    male          21.0       0      0    $8.05   S  NaN
45         0      3    male  Missing Data       0      0    $8.05   S  NaN
..       ...    ...     ...           ...     ...    ...      ...  ..  ...
884        0      3    male          25.0       0      0    $7.05   S  NaN
886        0      2    male          27.0       0      0    $13.0   S  NaN
891        0      2    male          24.0       0      0    $10.5   S  NaN
892        0      3    male          34.0       1      1    $14.4   S  NaN
893        0      3    male          36.0       0      0  $7.8958   S  NaN

[153 rows x 9 columns]

In [19]:
titanic.duplicated(keep="first", subset=["Survived", "Class"]).sum()

886

#### Olypmic Dataset

In [20]:
summer.head()

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [21]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31170 entries, 0 to 31169
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          31170 non-null  int64
 1   City          31170 non-null  object
 2   Sport         31170 non-null  object
 3   Discipline    31170 non-null  object
 4   Athlete Name  31170 non-null  object
 5   Country       31166 non-null  object
 6   Gender        31170 non-null  object
 7   Event         31170 non-null  object
 8   Medal         31170 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [22]:
summer.duplicated(keep="first").sum()

7

In [23]:
summer[summer.duplicated(keep=False)]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
2068,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
2069,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
12252,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
12253,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
15595,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
15596,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
16101,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
21832,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
21833,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
28677,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
28678,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
29784,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold

In [24]:
summer.loc[(summer.Sport == "Basketball") & (summer.Year == 2012)]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
29801,2012,London,Basketball,Basketball,"ANTHONY, Carmelo",USA,Men,Basketball,Gold
29802,2012,London,Basketball,Basketball,"BRYANT, Kobe",USA,Men,Basketball,Gold
29803,2012,London,Basketball,Basketball,"CHANDLER, Tyson",USA,Men,Basketball,Gold
29804,2012,London,Basketball,Basketball,"DAVIS, Anthony",USA,Men,Basketball,Gold
29805,2012,London,Basketball,Basketball,"DURANT, Kevin",USA,Men,Basketball,Gold
...,...,...,...,...,...,...,...,...,...
29868,2012,London,Basketball,Basketball,"MACLEOD, Kathleen",AUS,Women,Basketball,Bronze
29869,2012,London,Basketball,Basketball,"OHEA, Jenna",AUS,Women,Basketball,Bronze
29870,2012,London,Basketball,Basketball,"RICHARDS, Samantha",AUS,Women,Basketball,Bronze
29871,2012,London,Basketball,Basketball,"SCREEN, Jennifer",AUS,Women,Basketball,Bronze
29872,2012,London,Basketball,Basketball,"SNELL, Belinda",AUS,Women,Basketball,Bronze

### Handling / Removing Duplicates

#### Titanic Dataset

In [25]:
titanic.tail()

    Survived  Class Gender   Age  SibSip  ParCh     Fare Emb Deck
889        1      1   male  26.0       0      0    $30.0   C    C
890        0      3   male  32.0       0      0    $7.75   Q  NaN
891        0      2   male  24.0       0      0    $10.5   S  NaN
892        0      3   male  34.0       1      1    $14.4   S  NaN
893        0      3   male  36.0       0      0  $7.8958   S  NaN

In [26]:
titanic.duplicated().sum()

97

In [27]:
titanic[titanic.duplicated()]

    Survived  Class  Gender           Age  SibSip  ParCh     Fare Emb Deck
47         1      3  female  Missing Data       0      0    $7.75   Q  NaN
76         0      3    male  Missing Data       0      0  $7.8958   S  NaN
77         0      3    male  Missing Data       0      0    $8.05   S  NaN
87         0      3    male  Missing Data       0      0    $8.05   S  NaN
95         0      3    male  Missing Data       0      0    $8.05   S  NaN
..       ...    ...     ...           ...     ...    ...      ...  ..  ...
884        0      3    male          25.0       0      0    $7.05   S  NaN
886        0      2    male          27.0       0      0    $13.0   S  NaN
891        0      2    male          24.0       0      0    $10.5   S  NaN
892        0      3    male          34.0       1      1    $14.4   S  NaN
893        0      3    male          36.0       0      0  $7.8958   S  NaN

[97 rows x 9 columns]

In [28]:
titanic.drop(index=[891, 892, 893], inplace=True)

In [29]:
titanic.head()

  Survived  Class  Gender   Age  SibSip  ParCh      Fare Emb Deck
0        0      3    male  22.0       1      0     $7.25   S  NaN
1        1      1  female  38.0       1      0  $71.2833   C    C
2        1      3  female  26.0       0      0    $7.925   S  NaN
3        1      1  female  35.0       1      0     $53.1   S    C
4        0      3    male  35.0       0      0     $8.05   S  NaN

In [30]:
titanic.tail()

    Survived  Class  Gender   Age  SibSip  ParCh    Fare Emb Deck
886        0      2    male  27.0       0      0   $13.0   S  NaN
887        1      1  female  19.0       0      0   $30.0   S    B
888        0      3  female   NaN       1      2  $23.45   S  NaN
889        1      1    male  26.0       0      0   $30.0   C    C
890        0      3    male  32.0       0      0   $7.75   Q  NaN

In [31]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    object
 1   Class     891 non-null    int64
 2   Gender    891 non-null    object
 3   Age       755 non-null    object
 4   SibSip    891 non-null    int64
 5   ParCh     891 non-null    int64
 6   Fare      891 non-null    object
 7   Emb       889 non-null    object
 8   Deck      203 non-null    object
dtypes: int64(3), object(6)
memory usage: 69.6+ KB

#### Olympic Dataset

In [32]:
summer.head()

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [33]:
summer[summer.duplicated(keep = False)]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
2068,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
2069,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
12252,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
12253,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
15595,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
15596,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
16101,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
21832,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
21833,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
28677,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
28678,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
29784,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold

In [34]:
summer.drop(index = [2069, 12253, 15596, 21833, 28678], inplace = True)

In [35]:
summer[summer.duplicated(keep = False)]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
16101,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
29784,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold

In [36]:
summer.loc[16085:16110]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
16085,1980,Moscow,Hockey,Hockey,"PLESHAKOV, Sergei",URS,Men,Hockey,Bronze
16086,1980,Moscow,Hockey,Hockey,"PLESHAKOV, Vladimir",URS,Men,Hockey,Bronze
16087,1980,Moscow,Hockey,Hockey,"SYCHEV, Aleksandr",URS,Men,Hockey,Bronze
16088,1980,Moscow,Hockey,Hockey,"ZAGORODNEV, Oleg",URS,Men,Hockey,Bronze
16089,1980,Moscow,Hockey,Hockey,"ZIGANGIROV, Farit",URS,Men,Hockey,Bronze
16090,1980,Moscow,Hockey,Hockey,"ALLAN, Schofield",IND,Men,Hockey,Gold
16091,1980,Moscow,Hockey,Hockey,"AMARJIT RANA, Singh",IND,Men,Hockey,Gold
16092,1980,Moscow,Hockey,Hockey,"BASKARAN, Baskaran",IND,Men,Hockey,Gold
16093,1980,Moscow,Hockey,Hockey,"CHETTRI, Chettri",IND,Men,Hockey,Gold
16094,1980,Moscow,Hockey,Hockey,"DEAVINDER, Singh",IND,Men,Hockey,Gold
16095,1980,Moscow,Hockey,Hockey,"FERNANDES, Mervyn",IND,Men,Hockey,Gold
16096,1980,Moscow,Hockey,Hockey,"GURMAIL, Singh",IND,Men,Hockey,Gold
16097,1980,Moscow,Hockey,Hockey,"KAUSHIK, Maharaj Krishon",IND,Men,Hockey,Gold
16098,1980,Moscow,Hockey,Hockey,"KUMAR, Charanjit",IND,Men,Hockey,Gold
16099,1980,Moscow,Hockey,Hockey,"MANEYPANDA, Somaya",IND,Men,Hockey,Gold
16100,1980,Moscow,Hockey,Hockey,"MOHAMMAD, Shahid",IND,Men,Hockey,Gold
16101,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16103,1980,Moscow,Hockey,Hockey,"SURINDER, Singh",IND,Men,Hockey,Gold
16104,1980,Moscow,Hockey,Hockey,"SYLVANUS, Dung Dung",IND,Men,Hockey,Gold
16105,1980,Moscow,Hockey,Hockey,"ZAFAR, Zafar",IND,Men,Hockey,Gold
16106,1980,Moscow,Hockey,Hockey,"AMAT FONTANALS, Juan",ESP,Men,Hockey,Silver
16107,1980,Moscow,Hockey,Hockey,"ARBOS PERARNAU, Juan",ESP,Men,Hockey,Silver
16108,1980,Moscow,Hockey,Hockey,"ARBOS SERRA, Jaime",ESP,Men,Hockey,Silver
16109,1980,Moscow,Hockey,Hockey,"CABOT DURAN, Javier",ESP,Men,Hockey,Silver
16110,1980,Moscow,Hockey,Hockey,"CABOT DURAN, Ricardo",ESP,Men,Hockey,Silver

In [37]:
summer.loc[29780:29795]

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
29780,2012,London,Badminton,Badminton,"MOGENSEN, Carsten",DEN,Men,Doubles,Silver
29781,2012,London,Badminton,Badminton,"CHUNG, Jaesung",KOR,Men,Doubles,Bronze
29782,2012,London,Badminton,Badminton,"LEE, Yong Dae",KOR,Men,Doubles,Bronze
29783,2012,London,Badminton,Badminton,"TIAN, Qing",CHN,Women,Doubles,Gold
29784,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29785,2012,London,Badminton,Badminton,"FUJII, Mizuki",JPN,Women,Doubles,Silver
29786,2012,London,Badminton,Badminton,"KAKIIWA, Reika",JPN,Women,Doubles,Silver
29787,2012,London,Badminton,Badminton,"SOROKINA, Valeria",RUS,Women,Doubles,Bronze
29788,2012,London,Badminton,Badminton,"VISLOVA, Nina",RUS,Women,Doubles,Bronze
29789,2012,London,Badminton,Badminton,"ZHANG, Nan",CHN,Men,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29791,2012,London,Badminton,Badminton,"MA, Jin",CHN,Women,Doubles,Silver
29792,2012,London,Badminton,Badminton,"XU, Chen",CHN,Men,Doubles,Silver
29793,2012,London,Badminton,Badminton,"FISCHER, Joachim",DEN,Men,Doubles,Bronze
29794,2012,London,Badminton,Badminton,"PEDERSEN, Christinna",DEN,Women,Doubles,Bronze
29795,2012,London,Badminton,Badminton,"LIN, Dan",CHN,Men,Singles,Gold

In [38]:
alphabet[alphabet.duplicated(keep = False)]

  Alphabet
2        c
3        c
7        g
8        g
9        g

In [39]:
alphabet.drop_duplicates(inplace=True)

In [40]:
alphabet

  Alphabet
0        a
1        b
2        c
4        d
5        e
6        f
7        g

### The ignore_index parameter (NEW in Pandas 1.0)

In [1]:
import pandas as pd

C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.NOIJJG62EMASZI6NYURL6JBKM4EVBGM7.gfortran-win_amd64.dll
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
  stacklevel=1)

In [2]:
alphabet = pd.DataFrame(["a", "b", "c", "c", "d", "e", "f", "g", "g", "g"], columns = ["Alphabet"])

In [3]:
alphabet

  Alphabet
0        a
1        b
2        c
3        c
4        d
5        e
6        f
7        g
8        g
9        g

In [6]:
alphabet.drop_duplicates(ignore_index=True).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Alphabet  7 non-null      object
dtypes: object(1)
memory usage: 184.0+ bytes

### Detection of Outliers

In [ ]:
titanic.head()

In [ ]:
titanic.describe()

In [ ]:
plt.figure(figsize = (12,6))
titanic.boxplot("Age")
plt.show()

In [ ]:
plt.figure(figsize = (12,6))
titanic.Age.plot()
plt.show()

In [ ]:
titanic.Age.sort_values(ascending = False)

In [ ]:
titanic.loc[titanic.Age > 90]

In [ ]:
titanic.Fare.sort_values(ascending = False)

In [ ]:
plt.figure(figsize = (12,6))
titanic.Fare.plot()
plt.show()

### Handling / Removing Outliers

#### Titanic Dataset

In [ ]:
titanic.head()

In [ ]:
titanic.loc[titanic.Age > 90]

In [ ]:
index_outl  = titanic.loc[titanic.Age > 90].index

In [ ]:
index_outl

In [ ]:
titanic.loc[titanic.Age > 90, "Age"] = titanic.loc[titanic.Age > 90, "Age"]/10

In [ ]:
titanic.loc[index_outl]

In [ ]:
titanic.loc[217, "Age"] = 42.0

In [ ]:
plt.figure(figsize = (12,6))
titanic.Age.plot()
plt.show()

In [ ]:
titanic.info()

### Categorical Data

#### Titanic Dataset

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
#titanic.to_csv("titanic_clean.csv", index = False)

In [ ]:
titanic.nunique()

In [ ]:
titanic[["Gender", "Emb"]].describe()

In [ ]:
titanic.Gender = titanic.Gender.astype("category")

In [ ]:
titanic.Emb = titanic.Emb.astype("category")

In [ ]:
titanic.info()

In [ ]:
titanic.Gender.dtype

#### Olympic Dataset

In [ ]:
summer.head()

In [ ]:
summer.info()

In [ ]:
#summer.to_csv("summer_clean.csv", index = False)

In [ ]:
summer.describe(include = ["O"])

In [ ]:
summer.nunique()

In [ ]:
summer.City = summer.City.astype("category")

In [ ]:
summer.Sport = summer.Sport.astype("category")

In [ ]:
summer.Discipline = summer.Discipline.astype("category")

In [ ]:
summer.Country = summer.Country.astype("category")

In [ ]:
summer.Gender = summer.Gender.astype("category")

In [ ]:
summer.Medal = summer.Medal.astype("category")

In [ ]:
summer.info()

### Pandas Version 1.0: NEW Dtypes and pd.NA

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic

In [ ]:
titanic.info()

In [ ]:
titanic = titanic.convert_dtypes()

In [ ]:
titanic

In [ ]:
titanic.info()

In [ ]:
titanic.iloc[0, -1]

In [ ]:
type(titanic.iloc[0, -1])

In [ ]:
pd.NA